import { ImageBookPage } from '../types/interface/imagebook-page.interface';

export const IMAGEBOOK_PAGES: ImageBookPage[] = [
    {
        image: '/img/ruth1_01.png',
        texts: [
            '룻기'
            ,'1장'
            ,'1   1)사사 시대에 그 땅에 기근이 든 일이 있었다.'
            ,'그 때에, 유다 베들레헴 태생의 한 남자가, 모압 지방으로 가서 임시로 살려고,'
            ,'아내와 두 아들을 데리고 길을 떠났다.'
        ],
    },
    {
        image: '/img/ruth1_01.png',
        texts: [
            '2   그 남자의 이름은 2)엘리멜렉이고, 아내의 이름은 3)나오미이며, 두 아들의 이름은 4)말론과 5)기룐이다.'
            ,'그들은 유다 베들레헴 태생으로서, 에브랏 가문 사람인데, 모압 지방으로 건너가 거기에서 살았다.'
        ],
    },
    {
        image: '/img/ruth1_03_04.png',
        texts: [
            '3   그러다가 나오미의 남편 엘리멜렉이 죽자, 나오미와 두 아들만 남았다.'
            ,'4   두 아들은 다 모압 여자를 아내로 맞이하였는데, 6)한 여자의 이름은 7)룻이고, 또 한 여자의 이름은 8)오르바였다. 그들은 거기서 십 년쯤 살았다.',
        ],
    },
    {
        image: '/img/ruth1_05.png',
        texts: [
            '5   그러다가 아들 말론과 기룐이 죽으니, 나오미는 남편에 이어 두 아들마저 잃고, 홀로 남았다.'
        ],
    },
    {
        image: '/img/ruth1_06.png',
        texts: [
            '룻이 베들레헴으로 오다'
            ,'6   모압 지방에서 사는 동안에, 나오미는 주께서 백성을 돌보셔서, 고향에 풍년이 들게 하셨다는 말을 듣고, 두 며느리와 함께 모압 지방을 떠날 채비를 차렸다.'
        ],
    },
    {
        image: '/img/ruth1_06.png',
        texts: [
            '7   나오미가 살던 곳을 떠날 때에, 두 며느리도 함께 떠났다. 그들은 유다 땅으로 돌아가려고 길을 나섰다.'
        ],
    },
    {
        image: '/img/ruth1_07.png',
        texts: [
            '8   길을 가다가, 나오미가 두 며느리에게 말하였다. "너희는 제각기 친정으로 돌아가거라. 너희가, 죽은 너희의 남편들과 나를 한결같이 사랑하여 주었으니, 주께서도 너희에게 그렇게 해주시기를 빈다.'
            ,'9   너희가 각각 새 남편을 만나 행복한 가정을 이루도록, 주께서 돌보아 주시기를 바란다." 나오미가 작별하려고 그들에게 입을 맞추니, 며느리들이 큰소리로 울면서',
        ],
    },
    {
        image: '/img/ruth1_07.png',
        texts: [
            '10   말하였다. "아닙니다. 우리도 어머님과 함께 어머님의 겨레에게로 돌아가겠습니다."',
        ],
    },
    {
        image: '/img/ruth1_07.png',
        texts: [
            '11   그러나 나오미는 말렸다. "돌아가 다오, 내 딸들아. 어찌하여 나와 함께 가려고 하느냐? 9)아직, 내 뱃속에 아들들이 들어 있어서, 그것들이 너희 남편이라도 될 수 있다는 말이냐?'
        ],
    },
    {
        image: '/img/ruth1_11.png',
        texts: [
            '12   돌아가 다오, 내 딸들아. 제발 돌아가거라. 재혼을 하기에는, 내가 너무 늙었다. 설령, 나에게 어떤 희망이 있다거나, 오늘 밤 내가 남편을 맞아들여 아들들을 낳게 된다거나 하더라도,'
            ,'13   너희가, 그것들이 클 때까지 기다릴 셈이냐? 그 때까지 재혼도 하지 않고, 홀로들 지내겠다는 말이냐? 아서라, 내 딸들아. 너희들 처지를 생각하니, 내 마음이 너무나 괴롭구나. 주께서 손으로 나를 치신 것이 분명하다."'
        ],
    },
    {
        image: '/img/ruth1_14.png',
        texts: [
            '14   그들은 다시 한 번 큰소리로 울었다. 마침내, 오르바는 시어머니에게 입맞추면서 작별 인사를 드리고 떠났다. 그러나 룻은 오히려 시어머니 곁에 더 달라붙었다.'
            ,'15   그러자 나오미가 다시 타일렀다. "보아라, 네 동서는 저의 겨레와 신에게로 돌아갔다. 너도 네 동서의 뒤를 따라 돌아가거라."',
        ],
    },
    {
        image: '/img/ruth1_14.png',
        texts: [
            '16   그러자 룻이 대답하였다. "나더러, 어머님 곁을 떠나라거나, 어머님을 뒤따르지 말고 돌아가라고는 강요하지 마십시오. 어머님이 가시는 곳에 나도 가고, 어머님이 머무르시는 곳에 나도 머무르겠습니다. 어머님의 겨레가 내 겨레이고, 어머님의 하나님이 내 하나님입니다.'
            ,'17   어머님이 숨을 거두시는 곳에서 나도 죽고, 그 곳에 나도 묻히겠습니다. 죽음이 어머님과 나를 떼어놓기 전에 내가 어머님을 떠난다면, 주께서 나에게 벌을 내리시고 또 더 내리신다 하여도 달게 받겠습니다."'
            ,'18   나오미는 룻이 자기와 함께 가기로 굳게 마음먹은 것을 보고, 더 이상 말리지 않았다.',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '19   그 두 사람은 길을 떠나서, 베들레헴에 이르렀다. 그들이 베들레헴에 이르니, 온 마을이 떠들썩하였다. 아낙네들이 "이게 정말 나오미인가?" 하고 말하였다.',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '20   나오미가 그들에게 대답하였다. "나를 3)나오미라고 부르지들 마십시오. 10)전능하신 분께서 나를 몹시도 괴롭게 하셨으니, 이제는 나를 11)마라라고 부르십시오.',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '21   나는 가득 찬 채로 이 곳을 떠났습니다. 그러나 주께서는 나를 텅 비어서 돌아오게 하셨습니다. 주께서 나를 치시고, 10)전능하신 분께서 나를 12)불행하게 하셨는데, 이제 나를 나오미라고 부를 까닭이 어디에 있겠습니까?"',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '22   이렇게 하여 나오미는, 모압 여인인 며느리 룻과 함께 모압 지방에서 돌아왔다. 그들이 베들레헴에 이르렀을 때는, 보리를 거두기 시작할 무렵이었다.',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '',
        ],
    },
    {
        image: '/img/ibsmpl_page20.jpg',
        texts: [
            '',
        ],
    }
    // ... 페이지 추가
];